Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Clone the Git repository: `git clone {quickstarts-clone-url}` or download an {quickstarts-archive-url}[archive]. Locate the solution in the `infinispan-client-quickstart` {quickstarts-tree-url}/infinispan-client-quickstart[directory].
ja_jp: Git リポジトリをクローンします。 `git clone {quickstarts-clone-url}` または {quickstarts-archive-url}[アーカイブ]をダウンロードします。 `infinispan-client-quickstart` {quickstarts-tree-url}/infinispan-client-quickstart[ディレクトリ]でソリューションを探します。

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
ja_jp: `git clone {quickstarts-clone-url}` で Git リポジトリーをクローンします。または、{quickstarts-archive-url}[アーカイブ] をダウンロードします。

source: Clone the Git repository: git clone https://github.com/quarkusio/quarkus-quickstarts.git, or download an archive.
ja_jp: Git リポジトリのクローン: git clone https://github.com/quarkusio/quarkus-quickstarts.git 、またはアーカイブをダウンロードしてください。

source: Clone the git repository: `git clone {quickstarts-clone-url}`, or
ja_jp: git リポジトリーをクローンする: `git clone {quickstarts-clone-url}`、または

source: Clone the repository: `git clone {quickstarts-clone-url}`.
ja_jp: リポジトリーをクローンします (`git clone{quickstarts-clone-url}`)。

source: Close the response.
ja_jp: レスポンスを閉じます。

source: Close the session - this is close the connection with the database. The connection can then be recycled.
ja_jp: セッションを閉じる - これは、データベースとの接続を閉じることです。その後、接続を再利用することができます。

source: Closed-Source
ja_jp: クローズドソース

source: Closing the Gap: Test Coverage for Quarkus Extensions
ja_jp: ギャップを埋める：Quarkus エクステンションのテストカバレッジ

source: Cloud
ja_jp: クラウド

source: Cloud Events Function is a feature of Cloud Functions gen 2 only.
ja_jp: Cloud Events Function は、Cloud Functions gen 2のみの機能です。

source: Cloud Events Functions - Cloud Storage
ja_jp: Cloud Events Functions - クラウドストレージ

source: Cloud Events on the wire - the bindings
ja_jp: 転送におけるクラウドイベント - バインディング

source: Cloud Native
ja_jp: クラウドネイティブ

source: Cloud Native Memory Limits
ja_jp: クラウドネイティブのメモリ制限

source: Cloud Run supports link:https://cloud.google.com/run/docs/configuring/healthchecks[health checks], it is strongly advised to provide them thanks to Quarkus xref:smallrye-health.adoc[SmallRye Health] support.
ja_jp: Cloud Runは link:https://cloud.google.com/run/docs/configuring/healthchecks[ヘルスチェック] をサポートしています。 Quarkus xref:smallrye-health.adoc[SmallRye Health] サポートにより、ヘルスチェックを行うことを強くお勧めします。

source: Cloud Run supports link:https://cloud.google.com/run/docs/configuring/healthchecks[health checks], it is strongly advised to provide them thanks to Quarkus xref:smallrye-health.adoc[Smallrye Health] support.
ja_jp: Cloud Runは link:https://cloud.google.com/run/docs/configuring/healthchecks[ヘルスチェック]をサポートしていますが、Quarkus link:smallrye-health.html[Smallrye Health]のサポートによりヘルスチェックを行うことが強く推奨されます。

source: Cloud Run will use Cloud Build to build your Docker image and deploy it to Google Container Registry (GCR).
ja_jp: Cloud RunはCloud Buildを使用してDockerイメージを構築し、Google Container Registry(GCR)にデプロイします。

source: Cloud Services
ja_jp: クラウドサービス

source: Cloud run will ask you questions on the service name, the region and whether or not unauthenticated calls are allowed. After you answer to these questions, it will deploy your application.
ja_jp: Cloud run は、サービス名、リージョン、認証されていない呼び出しが許可されているかどうかについて質問をします。これらの質問に答えると、アプリケーションがデプロイされます。

source: Cloud run will ask you questions on the service name, the region and whether unauthenticated calls are allowed. After you answer to these questions, it will deploy your application.
ja_jp: Cloud run から、サービス名、リージョン、認証されていない呼び出しが許可されているかどうかについて質問されます。これらの質問に答えると、アプリケーションがデプロイされます。

source: Cluster (when working with Redis in Clustered mode).
ja_jp: クラスター (Redis を Clustered モードで動作させる場合)。

source: Cluster Health Check
ja_jp: クラスターヘルスチェック

source: Cluster Mode
ja_jp: クラスターモード

source: Clément Escoffier wrote a very comprehensive blog post about this enhancement that is very much worth reading: https://quarkus.io/blog/resteasy-reactive-smart-dispatch/[RESTEasy Reactive - To block or not to block].
ja_jp: Clément Escoffier氏は、この機能改良について非常に包括的なブログ記事を書いており、非常に読み応えがあります。 link:https://quarkus.io/blog/resteasy-reactive-smart-dispatch/[RESTEasy Reactive - To block or not to block].

source: Co-routines are a way to write asynchronous code sequentially. It suspends the execution of the code during I/O and registers the rest of the code as the continuation. Kotlin coroutines are great when developing in Kotlin and only need to express sequential compositions (chain of co-dependent asynchronous tasks).
ja_jp: コルーチンは、非同期のコードを逐次的に記述する方法です。I/O時にコードの実行を一時停止し、残りのコードを継続として登録します。Kotlinコルーチンは、Kotlinで開発する場合に最適であり、シーケンシャルコンポジション（相互依存する非同期タスクのチェーン）を表現するだけで済みます。

source: CoT architecture image
ja_jp: CoT アーキテクチャ図

source: Code
ja_jp: コード

source: Code and Issue Tracker
ja_jp: コードと課題管理

source: Code can be provided remotely (`src`) or as a property (`content`) or as a slotted value (example below).
ja_jp: コードはリモート (`src`) またはプロパティー (`content`) として、あるいはスロット値 (下記の例) として提供できます。

source: Code flow access token
ja_jp: コードフローアクセストークン

source: Code flow access token is not a primary token because it is not meant to be used to access the current Quarkus application which has completed the authorization code flow. Be it OIDC or OAuth2, the code flow access token is meant to be used to access another service on behalf of the currently authenticated user. For example, sending an `openid` scope during the authentication redirect to the provider leads to it issuing an access token that Quarkus application can use to fetch UserInfo from this provider on behalf of the user.
ja_jp: コードフローアクセストークンは、認可コードフローを完了した現在の Quarkus アプリケーションにアクセスするために使用されるものではないため、プライマリートークンではありません。OIDC であろうと OAuth2 であろうと、コードフローアクセストークンは現在認証されているユーザーに代わって別のサービスにアクセスするために使用されるものです。たとえば、プロバイダーへの認証リダイレクト中に `openid` スコープを送信すると、アクセストークンが発行され、Quarkus アプリケーションはそのユーザーに代わってこのプロバイダーから UserInfo を取得するために使用できます。

source: Code flow access token verification
ja_jp: コードフローアクセストークンの検証

source: Code flow access tokens are not introspected unless they are expected to be the source of roles but will be used to get `UserInfo`. So there will be one or two remote calls with the code flow access token, if the token introspection and/or `UserInfo` are required.
ja_jp: コードフローアクセストークンは、ロールのソースであることが期待されない限り、イントロスペクトされませんが、 `UserInfo` を取得するために使用されます。したがって、トークンのイントロスペクションや `UserInfo` が必要な場合は、コードフローアクセストークンを使用して 1 つまたは 2 つのリモート呼び出しが行われます。

source: Code flow access tokens are not introspected unless they are expected to be the source of roles. However, they will be used to get `UserInfo`. There will be one or two remote calls with the code flow access token if the token introspection, `UserInfo`, or both are required.
ja_jp: コードフローアクセストークンは、ロールのソースであると予想されない限り、イントロスペクトされません。 ただし、これらは `UserInfo` を取得するために使用されます。 トークンイントロスペクション または `UserInfo`、あるいはその両方が必要な場合は、コードフローアクセストークンを使用したリモート呼び出しが 1 回または 2 回発生します。

source: Code optimizations
ja_jp: コード最適化

source: Code-first approach
ja_jp: コードファーストのアプローチ

source: Code-first vs Contract-first
ja_jp: コード・ファーストと契約・ファースト

source: CodeReliant Blog:
ja_jp: CodeReliant ブログ:

source: CodeStarts as Default Project Generation Tool
ja_jp: デフォルトのプロジェクト生成ツールとしてのCodeStarts

source: CodeStarts is now the default project generation tool
ja_jp: CodeStarts はデフォルトのプロジェクト生成ツールになりました。

source: Codestart application template
ja_jp: Codestart アプリケーションテンプレート

source: Codestarts are designed to make it easy and quick to provide new examples for extensions. So whether you are an extension owner, or you are keen to create an example for an extension you like, contributions are very welcome!
ja_jp: コードスタートは、エクステンションのための新しいサンプルを簡単かつ迅速に提供できるように設計されています。ですから、あなたがエクステンションの所有者の場合でも、あなたが好きなエクステンションの例を作りたい場合でも、貢献は大歓迎です!

source: Codestarts are templates which can be used to generate applications for users. Extensions can xref:extension-codestart.adoc[provide their own codestart templates].
ja_jp: Codestarts は、ユーザー向けのアプリケーションを生成するために使用できるテンプレートです。 エクステンションは、xref:extension-codestart.adoc[独自のコードスタートテンプレートを提供する] ことができます。

source: Codestarts are working the same way when contributing to the generation of a project, they are split in two categories:
ja_jp: Codestart は、プロジェクトの生成に貢献する際に同じように働き、2つのカテゴリーに分けられます。

source: Codestarts may use Qute templates `MyClass.tpl.qute.java` for dynamic rendering.
ja_jp: Codestartは、ダイナミックレンダリングのために Qute テンプレート `MyClass.tpl.qute.java` を使用することができます。

source: Cohort is assigned by a `io.quarkus.load.shedding.RequestClassifier`. There is 128 statically defined cohorts, with the lowest number being 1 and highest number being 128. The classifier should return a number in this interval; if it does not, the number is adjusted automatically.
ja_jp: コホートは `io.quarkus.load.shedding.RequestClassifier` によって割り当てられます。 静的に定義されたコホートは 128 あり、最小番号は 1、最大番号は 128 です。 分類子はこの範囲内の番号を返す必要があります。返さない場合、番号が自動的に調整されます。

source: Collaboration between Quarkus and Polaris Communities
ja_jp: QuarkusコミュニティーとPolarisコミュニティーのコラボレーション

source: Collect metrics using Micrometer
ja_jp: Micrometerを用いたメトリクスの収集

source: Collecting Metrics with Micrometer
ja_jp: Micrometerでメトリクスを収集する

source: Collecting Metrics with SmallRye Metrics
ja_jp: SmallRye Metricsを使用したメトリクスの収集

source: Collections
ja_jp: コレクション

source: Collections and relations need to be individually annotated to be cached; in this case the Hibernate specific `@org.hibernate.annotations.Cache` should be used, which requires also to specify the `CacheConcurrencyStrategy`:
ja_jp: コレクションとリレーションはキャッシュするために個別にアノテーションする必要があります。この場合、Hibernate固有の `@org.hibernate.annotations.Cache` を使用する必要があり、さらに `CacheConcurrencyStrategy` を指定する必要があります:

source: Collections are cached in regions named after the fully qualified name of their owner entity and collection field name, separated by `#` character, e.g. `org.acme.Country#cities`.
ja_jp: `org.acme.Country#cities` コレクションは保持するエンティティの完全修飾名とコレクションのフィールド名を `#` 文字で区切った名前の領域にキャッシュされます。

source: Collections are supported
ja_jp: コレクションがサポートされています。

source: Collector endpoint. Assuming a container service name 'jaeger' is running.
ja_jp: コレクターのエンドポイント。コンテナサービス名 'jaeger' が実行されていると仮定します。

source: Coloration settings are available at `Preferences | Editor | Color Scheme | Qute`.
ja_jp: カラーリングの設定は `Preferences | Editor | Color Scheme | Qute` 。

source: Combine HTTP and the Event Bus
ja_jp: HTTPとEvent Busの組み合わせ

source: Combine both the familiar imperative code and the reactive style when developing applications.
ja_jp: 慣れ親しんだ命令型のコードとリアクティブ形のスタイルの両方を組み合わせて、アプリケーションを開発することができます。

source: Combine both the familiar imperative code and the reactive style when developing applications. <a href="/continuum">Learn more</a>.
ja_jp: <a href="/continuum">詳しくはこちら</a>。

source: Combining Authentication Mechanisms
ja_jp: 認証メカニズムの組み合わせ

source: Combining ConfigProperties with build time conditions
ja_jp: ConfigPropertiesとビルド時条件の組み合わせ

source: Combining HTTP and the event bus
ja_jp: HTTPとイベントバスの融合

source: Combining RESTEasy Reactive, Hibernate ORM and Kafka
ja_jp: RESTEasy Reactive、Hibernate ORM、Kafkaの組み合わせ

source: Combining authentication mechanisms
ja_jp: 認証メカニズムの組み合わせ

source: Combining blocking, reactive, managed, stateless code
ja_jp: ブロッキング、リアクティブ、管理、ステートレスなコードの組み合わせ

source: Combining expressions
ja_jp: 式を組み合わせる

source: Come Join Us
ja_jp: 参加のお誘い

source: Comes from the OpenTelemetry autoconfiguration. If true, will disable the OpenTelemetry SDK usage at *runtime*.
ja_jp: OpenTelemetry autoconfiguration から取得されます。true の場合、*実行時* に OpenTelemetry SDK の使用が無効化されます。

source: Comma separated list of the audiences that a token `aud` claim may contain.
ja_jp: トークン `aud` クレームに含まれる可能性のあるオーディエンスのコンマ区切りリスト。

source: Comma separated list of the audiences that a token `aud` claim may contain. This property is deprecated - use `mp.jwt.verify.audiences`.
ja_jp: トークン `aud` クレームに含まれる可能性のあるオーディエンスのコンマ区切りリスト。このプロパティーは推奨されません。 `mp.jwt.verify.audiences` を使用してください。

source: Comma separated list of the claims that a token must contain.
ja_jp: トークンに含める必要のあるクレームのコンマ区切りリスト。

source: Comma separated values for configuring ack timeout MultiplierRedeliveryBackoff, min delay, max delay, multiplier.
ja_jp: カンマ区切りの値で ack タイムアウトを設定 MultiplierRedeliveryBackoff、min delay、max delay、multiplier。

source: Comma separated values for configuring negative ack MultiplierRedeliveryBackoff, min delay, max delay, multiplier.
ja_jp: 負の ack を設定するためのカンマ区切りの値 MultiplierRedeliveryBackoff、min delay、max delay、multiplier。

source: Comma-separated list containing alternative single or multiple schemes, such as `DPoP`.
ja_jp: `DPoP` などの単一または複数の代替スキームを含むコンマ区切りのリスト。

source: Comma-separated list containing an alternative single or multiple schemes, for example, `DPoP`.
ja_jp: `DPoP` などの単一または複数の代替スキームを含むコンマ区切りのリスト。

source: Comma-separated list of artifact keys (`groupId:artifactId:classifier:type`) that are to be loaded in a parent first manner. This can be used to work around issues where a given class needs to be loaded by the system ClassLoader.
ja_jp: 親から先にロードされるアーティファクトキー (`groupId:artifactId:classifier:type`) のコンマ区切りリスト。これは、システム ClassLoader によって特定のクラスをロードする必要がある問題を回避するために使用できます。

source: Comma-separated list of artifact keys that are to be loaded in a parent first manner in addition to those configured with `parent-first-artifacts` when an application is launched from a production binary package. This can be used to work around issues where a given class needs to be loaded by the system ClassLoader.
ja_jp: アプリケーションが本番バイナリーパッケージから起動されたときに、 `parent-first-artifacts` で設定されたものに加えて、親が最初に読み込まれるアーティファクトキーのコンマ区切りリスト。これは、システム ClassLoader によって特定のクラスをロードする必要がある問題を回避するために使用できます。

source: Comma-separated list of artifact keys that will never be loaded by the class loader, and will not be packed into the final application.
ja_jp: クラスローダーによってロードされず、最終的なアプリケーションにパックされないアーティファクトキーのコンマ区切りリスト。

source: Comma-separated list of artifact keys that will only be used to load a class or resource if no other artifact containing that class or resource exists. This is used in order to control the order of artifacts when multiple contain the same classes.
ja_jp: クラスまたはリソースを含む他のアーティファクトが存在しない場合にのみ、そのクラスまたはリソースをロードするために使用されるアーティファクトキーのコンマ区切りリスト。これは、複数のアーティファクトに同じクラスが含まれている場合に、アーティファクトの順番を制御するために使用されます。

source: Comma-separated list of audiences a token `aud` claim might contain.
ja_jp: トークン aud クレームに含まれる可能性のあるオーディエンスのコンマ区切りリスト。

source: Comma-separated list of audiences a token `aud` claim might contain. This property is deprecated - use `mp.jwt.verify.audiences`.
ja_jp: トークン `aud` クレームに含まれる可能性のあるオーディエンスのコンマ区切りリスト。このプロパティーは非推奨です。 `mp.jwt.verify.audiences` を使用してください。

source: Comma-separated list of the claims a token must contain.
ja_jp: トークンに含める必要があるクレームのコンマ区切りリスト。

source: Command Line Applications
ja_jp: コマンドラインアプリケーション

source: Command Line Interface
ja_jp: コマンドラインインターフェース

source: Command Mode Applications
ja_jp: コマンドモードアプリケーション

source: Command Mode Reference
ja_jp: コマンドモードリファレンス

source: Command Mode applications can be tested using the `@QuarkusMainTest` and `@QuarkusMainIntegrationTest` annotations. These work in a similar way to `@QuarkusTest` and `@QuarkusIntegrationTest` where `@QuarkusMainTest` will run the CLI tests within the current JVM, while `QuarkusIntegrationTest` is used to run the generated executable (both jars and native).
ja_jp: コマンドモード・アプリケーションは、 `@QuarkusMainTest` および `@QuarkusMainIntegrationTest` のアノテーションを使用してテストすることができます。これらは、 `@QuarkusTest` および `@QuarkusIntegrationTest` と同様の方法で動作します。 `@QuarkusMainTest` は現在のJVM内でCLIテストを実行し、 `QuarkusIntegrationTest` は生成された実行ファイル（ジャーおよびネイティブの両方）を実行するために使用されます。

source: Command Mode with Picocli
ja_jp: Picocli を使ったコマンドモード

source: Command line application with multiple Commands
ja_jp: 複数のコマンドを使用したコマンドラインアプリケーション

source: Command line arguments can be passed to the application through the `-D` flag with the property `quarkus.args`:
ja_jp: コマンドライン引数は、プロパティ `quarkus.args` で `-D` フラグを介してアプリケーションに渡すことができます。

source: Commands enqueued in a transaction are not executed before the whole transaction is executed. It means that you cannot retrieve a result during the transaction. Results are accumulated in a `TransactionResult` object you will access after the completion of the transaction. This object contains whether the transaction succeeded or was discarded, and in the former case the result of each command (indexed by the command order).
ja_jp: トランザクション内でキューに入れられたコマンドは、トランザクション全体が実行される前に実行されることはありません。つまり、トランザクションの最中に結果を取得することはできません。結果はトランザクションの完了後にアクセスする `TransactionResult` オブジェクトに蓄積されます。このオブジェクトには、トランザクションが成功したか破棄されたかに関係なく含まれ、成功した場合は各コマンドの結果 (コマンドの順番でインデックス化されています) が含まれます。

source: Commands may also be stacked:
ja_jp: コマンドはスタックすることもできます。

source: Comment
ja_jp: コメント

source: Commit Strategies
ja_jp: コミットストラテジー

source: Commit and push your changes to the remote Git repository.
ja_jp: 変更をコミットして、リモートの Git リポジトリにプッシュします。

source: Commit the Kafka transaction only if the entity is persisted successfully.
ja_jp: エンティティーが正常に永続化された場合にのみ、Kafka トランザクションをコミットします。

source: Commit the files: `git commit -a -m 'Initial copy of getting-started'`.
ja_jp: ファイルをコミットします: `git commit -a -m 'Initial copy of getting-started'`

source: Committing every offset has performance penalties as Kafka offset management can be slow. However, not committing the offset often enough may lead to message duplication if the application crashes between two commits.
ja_jp: オフセットを毎回コミットすることは、Kafkaのオフセット管理のオーバーヘッドを増やすため、パフォーマンスペナルティにつながります。ただし、オフセットを十分な頻度でコミットしないと、2 つのコミットの間にアプリケーションがクラッシュした場合に、メッセージが重複する可能性があります。

source: Common Datasource
ja_jp: 共通のデータソース

source: Common Datasource Configuration Reference
ja_jp: 共通データソース構成リファレンス

source: Common code for all supported security event types is possible because they all implement the `io.quarkus.security.spi.runtime.SecurityEvent` interface.
ja_jp: サポートされているすべてのセキュリティ・イベント・タイプは、すべて `io.quarkus.security.spi.runtime.SecurityEvent` インターフェースを実装しているので、共通のコードで扱うことが出来ます。

source: Common cookie properties
ja_jp: 共通 Cookie プロパティー

source: Common datasource configuration reference
ja_jp: 共通データソース設定リファレンス

source: Common project setup
ja_jp: プロジェクトの共通設定

source: Communicate with pub/sub
ja_jp: pub/subとの通信

source: Communicating to the backend
ja_jp: バックエンドとの通信

source: Communities are a critical aspect to any open source project’s success, including Quarkus. It is no surprise that the health of a community is a major consideration when an adoption decision must be made. For Adoptium, this is made clear by example:
ja_jp: コミュニティは、Quarkusを含め、あらゆるオープンソースプロジェクトの成功に欠かせない要素です。採用を決定する際にコミュニティの健全性が重要視されるのは当然のことです。Adoptiumでは、これは例を見れば明らかです。

source: Community & Standards
ja_jp: コミュニティ＆標準

source: Community Call
ja_jp: コミュニティーコール

source: Community and Standards
ja_jp: コミュニティと標準

source: Compare the CSRF form field and cookie values and fail with HTTP status `400` if they don't match.
ja_jp: CSRFのフォームフィールドとクッキーの値を比較し、一致しない場合はHTTPステータス `400` で失敗します。

source: Compare your result against the complete worked example:
ja_jp: 結果を完璧な作業例と比較してください:

source: Compared to the pom.xml from the <<vertx-oidc-quarkus>> section above, this pom.xml no longer has dependencies in the `io.vertx` group but retains two Quarkus dependencies in the `io.quarkus` group, `quarkus-vertx-http` and `quarkus-qute`, and adds several more Quarkus dependencies.
ja_jp: 上記の <<vertx-oidc-quarkus>> セクションの pom.xml と比較すると、この pom.xml には `io.vertx` グループの依存関係はもうありませんが、 `io.quarkus` グループの 2 つの Quarkus 依存関係である `quarkus-vertx-http` と `quarkus-qute` は保持され、さらにいくつかの Quarkus 依存関係が追加されています。

source: Compared to the pom.xml from the <<vertx-oidc-vertx>> section, this pom.xml retains only two original Vert.x dependencies in the `io.vertx` group, `vertx-web-client` to support GitHub API calls, and `vertx-auth-oauth2` to continue securing the protected endpoint with the Vert.x GitHub OAuth2 provider.
ja_jp: <<vertx-oidc-vertx>> セクションの pom.xml と比較すると、この pom.xml は `io.vertx` グループのオリジナルの Vert.x 依存関係を 2 つだけ保持しています。GitHub API 呼び出しをサポートする `vertx-web-client` と、Vert.x GitHub OAuth2 プロバイダーで保護されたエンドポイントのセキュリティーを継続するための `vertx-auth-oauth2` です。

source: Compatibility
ja_jp: 互換性

source: Compatibility Table
ja_jp: 互換性表

source: Compatibility layers
ja_jp: 互換性レイヤー

source: Compatibility with Apicurio Registry 2.x Server
ja_jp: Apicurio Registry 2.x サーバーとの互換性

source: Compatibility with Quarkus 1.x
ja_jp: Quarkus 1.xとの互換性

source: Compatibility with other languages and frameworks
ja_jp: 他の言語やフレームワークとの互換性

source: Compatible with Quarkus
ja_jp: Quarkusと互換性あり

source: Compilation takes a bit longer, so this step is disabled by default.
ja_jp: コンパイルには少し時間がかかるため、この手順はデフォルトで無効になっています。

source: Compilation takes a bit longer, so this step is turned off by default; let's build again by enabling the native build:
ja_jp: コンパイルには少し時間がかかるため、この手順はデフォルトでオフになっています。 ネイティブビルドを有効にして再度ビルドしてみましょう。

source: Compilation takes longer and is disabled by default. To build the application, enable the `native` profile.
ja_jp: コンパイルには時間がかかるため、デフォルトでは無効になっています。 アプリケーションをビルドするには、 `native` プロファイルを有効にします。

source: Compilation takes longer, so this step is turned off by default. To build again, enable the `native` profile:
ja_jp: コンパイルには時間がかかるため、この手順はデフォルトでオフになっています。 再度ビルドするには、 `native` プロファイルを有効にします。

source: Compilation takes longer, so this step is turned off by default. You can build again by enabling the native build:
ja_jp: コンパイルには時間がかかるので、このステップはデフォルトでオフになっています。ネイティブビルドを有効にすれば、再度ビルドできます：

source: Compilation will take a bit longer, so this step is disabled by default; let's build a native executable with the following command:
ja_jp: コンパイルには少し時間がかかるので、このステップはデフォルトでは無効になっています。以下のコマンドでネイティブ実行可能ファイルをビルドしてみましょう。

source: Compilation will take a bit longer, so this step is disabled by default; let's build again by enabling the `native` profile:
ja_jp: コンパイルには少し時間がかかるので、このステップはデフォルトで無効になっています。 `native` プロファイルを有効にして再度ビルドしてみましょう。

source: Compilation will take a bit longer, so this step is disabled by default; let's build again by enabling the native build:
ja_jp: コンパイルには少し時間がかかるので、このステップはデフォルトで無効になっています。ネイティブビルドを有効にして再度ビルドしてみましょう。

source: Compile Quarkus Quickly
ja_jp: Quarkusの迅速なコンパイル

source: Compile and run the application
ja_jp: アプリケーションのコンパイルと実行

source: Compile and run the application as `java -jar target/oauth-oidc-1.0.0-SNAPSHOT-fat.jar`, go to `http://localhost:8080` and follow the https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] tutorial to login to GitHub and get your GitHub account email(s) displayed.
ja_jp: `java -jar target/oauth-oidc-1.0.0-SNAPSHOT-fat.jar` としてアプリケーションをコンパイルして実行し、 `http://localhost:8080` にアクセスして https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルに従い GitHub にログインすると、GitHub アカウントのメールアドレスが表示されます。

source: Compile and run your Quarkus application by using one of the following methods:
ja_jp: 次のいずれかの方法で、Quarkusアプリケーションをコンパイルして実行します:

source: Compile the application:
ja_jp: アプリケーションをコンパイルします。

source: Compiled code
ja_jp: コンパイルされたコード

source: Compiling H2 into a native-image is now possible (it didn't use to be) but this is considered experimental; even if this is technically possible, we would still recommend to consider carefully why you would want to embed H2 within your native-image.
ja_jp: H2をネイティブイメージにコンパイルすることは可能です（以前はできませんでした）が、これは実験的なものと考えられています。技術的に可能であっても、なぜH2をネイティブイメージに埋め込みたいのか、慎重に検討することをお勧めします。

source: Compiling Quarkus application using virtual threads into native executable
ja_jp: 仮想スレッドを使用した Quarkus アプリケーションのネイティブ実行可能ファイルへのコンパイル

source: Compiling a native executable takes a bit longer, as GraalVM performs additional steps to remove unnecessary codepaths. Use the `native` profile to compile a native executable:
ja_jp: GraalVMは、不要なコードパスを削除するために追加のステップを実行するため、ネイティブ実行可能ファイルのコンパイルには少し時間がかかります。 `native` プロファイルを使用して、ネイティブ実行可能ファイルをコンパイルしてください。
